{"meta":{"title":"CastBox","subtitle":null,"description":null,"author":"CastBox Team","url":"http://blog.castbox.fm"},"pages":[],"posts":[{"title":"The Fools Who Dream: Calling All Talents!","slug":"The-Fools-Who-Dream-Calling-All-Talents","date":"2017-02-03T21:11:33.000Z","updated":"2017-02-03T08:22:34.000Z","comments":true,"path":"2017/02/04/The-Fools-Who-Dream-Calling-All-Talents/","link":"","permalink":"http://blog.castbox.fm/2017/02/04/The-Fools-Who-Dream-Calling-All-Talents/","excerpt":"","text":"I used to have so many dreams when I was a little girl… My first dream was to become an actress, playing the role I want, just like Emma Stone, in La La Land: Then I thought… I have a pretty attractive voice, so why waste it? So I changed my dream in becoming a singer: But then… you know kids always change with their moods. I thought, DJ sounds a like even cooler job: My mind was changed so many times until I landed my first job- not an actress, not a singer, not a DJ. While I’m happy with my job, those dreams have never really left me. I’d still think of them, and try accomplishing them little by little, during my spare time. I have a to-do-list for my 2017, and first thing first, to create my own podcast! BUT! BUT! HOW DO I START?! HOW?! HOW?! That’s why we need you! CastBox is currently looking for writers who are willing to share their experiences related to the podcasting industry! The content of articles can vary from recommendations of audio softwares to strategies of how to successfully create a podcast! You could also give out a list of your favorite your podcasts and explain why people should check them out! You can also use this as a way to promote your own podcast channel! We’d like to publish your article on our website, and promote it for you on our social media platform, to help those who have a passion in joining the podcasting community! Ready for your work to be published, and welcome new members to our podcasting family? Email us at media@castbox.fm with your submission! Last but not least, to those who are like me, to the ones who dream,","categories":[],"tags":[],"keywords":[]},{"title":"Enhance Your General Wellbeing — Top 10 Health Podcasts You Must Check Out in 2017","slug":"Enhance-Your-General-Wellbeing-—-Top-10-Health-Podcasts-You-Must-Check-Out-in-2017","date":"2017-01-13T00:36:58.000Z","updated":"2017-01-12T12:01:12.000Z","comments":true,"path":"2017/01/13/Enhance-Your-General-Wellbeing-—-Top-10-Health-Podcasts-You-Must-Check-Out-in-2017/","link":"","permalink":"http://blog.castbox.fm/2017/01/13/Enhance-Your-General-Wellbeing-—-Top-10-Health-Podcasts-You-Must-Check-Out-in-2017/","excerpt":"","text":"Check out the most popular health podcasts from around world. You can stream &amp; download them all using CastBox, the leading podcast app offering 340,000+ high quality podcasts for free. 10. Sleep With Me | Helps You Fall Asleep Via Silly Boring Bedtime Stories Sleep With Me is a groundbreaking podcast that helps you get to sleep through the use of stories “interesting enough so that you forget your problems but boring enough so that you fall asleep.” Just press play and close your eyes. 9. The Meditation Podcast The Meditation Podcast provides guided meditations that can help relieve the stress of daily life, focus the mind, and develop a more unified state of consciousness. Contains music technology that actively lowers the brain waves, aiding the relaxation process. 8. Happier with Gretchen Rubin Bestselling author Gretchen Rubin gives practical and manageable advice on how to live a more happy life. Topics range from love to work and play. Co-hosted by Rubin’s younger sister who affectionately refers to the former as her ‘happiness bully.’ 7. The School of Greatness with Lewis Howes Join Lewis Howes as he finds out what makes great people great by exploring the lives of leading business figures, world-class athletes, and A-list celebrities. These inspiring stories will give you the motivation and the nohow to achieve your goals. 6. Death, Sex &amp; Money Host Anna Sale converses with celebrities and the general public on the topics of life, relationships, money, family, and happiness. Death, Sex &amp; Money is concerned with the big questions and hard choices that often find themselves at the back of people’s minds. 5. Inspirational Living: Motivation, Self-Help, Spirituality &amp; Positive Thinking Inspirational Living offers podcasts aimed at mastering the art of living a life of “success, happiness, creativity, and beauty.” Each episode is adapted from the works of prominent authors and self-help professionals, providing useful, current, and practical advice. 4. Psychology in Everyday Life: The Psych Files Psychologist Michael Britt discusses topics in the field of psychology and how they apply to everyday life. This fun and upbeat podcast as something for everyone be they psychology students or those simply interested in people and how they tick. 3. TEDTalks Health TEDTalks Health hosts the world’s leading doctors, medical researchers, and health professionals as they share their invaluable stories and insights with the general public. Topics include medicine, daily habits, nutrition, and mental health. 2. Motivational Mornings Motivation is a key foundation upon which success can be built. Motivational Mornings shares stories, extracting useful lessons that will inspire, impress, and encourage, helping you to develop the will and drive to get the most out of life. 1. The Tim Ferriss Show Join Tim Ferriss as he deconstructs world-class individuals from a variety of fields (sports, investing, entertainment, etc.) and reveals the tips, tricks, and techniques they use for success. Interesting, informative, and potentially, life-changing. Wanna have your own podcast? You can upload your podcast/audio files and start your channel for free on CastBox.FM! CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts using CastBox , the leading podcast app offering 340,000+ high quality podcasts for free. Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]},{"title":"2017 U.S. Podcasting Events & Conferences Worth Attending","slug":"2017-U-S-Podcasting-Events-Conferences-Worth-Attending","date":"2016-12-14T00:19:58.000Z","updated":"2016-12-13T11:41:21.000Z","comments":true,"path":"2016/12/14/2017-U-S-Podcasting-Events-Conferences-Worth-Attending/","link":"","permalink":"http://blog.castbox.fm/2016/12/14/2017-U-S-Podcasting-Events-Conferences-Worth-Attending/","excerpt":"","text":"1. The Podcast Movement This is a great event for anyone who’s currently involved with, or looking to get into, podcasting and the podcast industry. With the help of over 100 speakers from the best podcasts and the most successful podcast networks and companies, taking part in over 80 different sessions, the podcast movement is a podcast networking event you don’t want to miss. When: Aug 22nd — Aug 25th, 2017 Where: Anaheim, CA, USA Cost: http://podcastmovement.com/attend/ For more information, check out their website at http://podcastmovement.com/ 2. Mid-Atlantic Podcast Conference Podcast Mid-Atlantic started (December 2014) as a Facebook group for podcasters who live in the Mid-Atlantic States (North Carolina, Virginia, Delaware, Pennsylvania, New Jersey, New York, and Connecticut). The idea was to bring podcasters together for meet ups, Google Hangouts and eventually grow into conferences. So, if you happen to be in the northeast are, and unfortunately cannot fly all the way to Cali, the Mid-Atlantic Podcast Conference should definitely be an event considering going to. When: Sep 8th-9th, 2017 Where: Greater Philadelphia Area, PA, at Holiday Inn Philadelphia South-Swedesboro Cost: only the virtual ticket for 2016’s event is available for sale now at $100; we’ll keep an eye on the ticket info updates For more information, check out their website at http://podcastmidatlantic.com/ 3. Podcast Cruise 2017 Rather attend a conference on the ocean? Then the podcast cruise is the perfect choice for you! PODCAST CRUISE will combine some of the world’s top podcast personalities with an elite group of attendees, as they join forces to discuss emerging strategies, latest trends, and best practices that will help you create, grow, and monetize your podcast. Whether you’re just getting started, you’re trying to get better, or you are ready to take a giant leap, the PODCAST CRUISE is for you. When: Feb 11th-16th, 2017 Where: Depart and Arrive in Fort Lauderdale, FL Cost: $500 at http://2017.podcastcruise.com/register/ (Register soon! Only few spots left) For more information, check out their website at http://2017.podcastcruise.com/ 4. Podfest Orlando, Florida is always a right place to go to! The core focus of Podfest is on the Education, Collaboration and the PME Community! This year they are expanding their conference and adding tracks that will be featuring YouTubers, Conference Builders, Live Streaming, Blogging, Independent Filmmaking, and Online Community Building! Here is the personal touch from the organizer, Chris, of Podfest: “Here’s a little known fact…I was born deaf in my right ear and had many surgeries as a child to reconstruct what was not there. I have always identified with others who believe in their heart of hearts that anything is possible. As a kid I was always the underdog, but my belief in myself always helped me manifest everything I set out to accomplish. I identify with Podcasters and online content creators because, by and large, they have so many obstacles up against them and yet they have a burning desire that compels them to get their message out. This is why PME17 is not just a conference, but a family made up of fellow attendees that keep coming back year after year! If you are one of those unique individuals, then look no further because PME17 was created just for you!” When: Feb 23rd-25th, 2017 Where: Orlando, FL Cost: $319 — $367 at http://podfest.us/2017/tickets/ For more information, check out their website at http://podfest.us/2017/ 5. Hivio The detailed information for Hivio 2017 has not come out yet. In 2016, the event brought together more than 100 of the most influential people in audio and media for two days of candid, unscripted conversation. Amazing thought-leaders and provocative presentations. No boring panels. No celebrity keynoters. You can check out the highlights of 2016’s event here: https://www.youtube.com/watch?v=y-_B-tLHmPc When: TBD (June 2nd-3rd, 2016) Where: TBD (LOS ANGELES, CA, ANDAZ HOLLYWOOD HOTEL) Cost: Varies by Session For more information, check out their website at http://hivio.com/#/ It’s never too late to join the podcasting community! You can upload your podcast(via RSS feed)/audio files and start your channel for free on CastBox.FM! CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts using CastBox , the leading podcast app offering 340,000+ high quality podcasts for free. Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]},{"title":"Keep Informed with the Latest Headlines — 2016 Top 10 News & Politics Podcasts","slug":"Keep-Informed-with-the-Latest-Headlines-—-2016-Top-10-News-Politics-Podcasts","date":"2016-12-11T15:11:48.000Z","updated":"2016-12-11T02:36:26.000Z","comments":true,"path":"2016/12/11/Keep-Informed-with-the-Latest-Headlines-—-2016-Top-10-News-Politics-Podcasts/","link":"","permalink":"http://blog.castbox.fm/2016/12/11/Keep-Informed-with-the-Latest-Headlines-—-2016-Top-10-News-Politics-Podcasts/","excerpt":"","text":"Check out the most popular tech podcasts from around world in 2016. You can stream &amp; download them all using CastBox, the leading podcast app offering 340,000+ high quality podcasts for free. 10. The Economist Radio The Economist was founded in 1843 “to throw white light on the subjects within its range.” The regular podcast provides news and analysis on political, economic and cultural matters worldwide. 9. Radiolab Presents: More Perfect Radiolab’s More Perfect podcast focuses on the Supreme Court of the United States and how cases deliberated and decisions made there affect our lives far away from the bench. 8. NPR Politics Podcast Weekly roundups and quick takes on news of the day from NPR’s political reporters. Sharp analysis and witty commentary on the latest in news, politics, economics, and global events. 7. The Documentary The Documentary provides the best in BBC World Service documentaries and other factual programs. Past episodes include the rise of Google, the Obama presidency, and protesting in Putin’s Russia. 6. Friday Night Comedy from BBC Radio 4 Download some of the BBC’s finest new comedy programs. Friday Night Comedy features shows such as The News Quiz, The Now Show, Dead Ringers, and The Museum of Curiosity. 5. Planet Money For fun and informative economics, look no further than the Planet Money podcast. A twice weekly, easy-to-understand exploration of the world economy, Planet Money episodes have even been incorporated into some university economics programs. 4. Global News Podcast Brought to you by the BBC, the Global News Podcast provides the day’s top stories from around the world. Episodes are released twice per weekday and once every saturday and sunday. 3. This American Life Inspiring the emmy award-winning TV show of the same name, This American Life releases episodes weekly, each driven by a particular theme relevant to the american experience. Half a dozen stories from the podcast are being developed into films. 2. Serial From the creators of This American Life, join Sarah Koenig as she narrates a single, fascinating story over the course of an entire season. Season 1 told of the 1999 murder of a Baltimore high school student, a case with many loose ends even today. 1. TEDTalks The TEDTalks series of podcasts host the world’s leading thinkers and doers as they share ideas on the frontier of human understanding and experience. An absolute must for all podcasters, TEDTalks never fails to inspire, intrigue and stir the imagination. Wanna have your own podcast? You can upload your podcast/audio files and start your channel for free on CastBox.FM! CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts using CastBox , the leading podcast app offering 340,000+ high quality podcasts for free. Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]},{"title":"CastBox Being Selected as One of Google Play’s “Best of 2016”","slug":"CastBox-Being-Selected-as-One-of-Google-Play’s-“Best-of-2016”","date":"2016-12-02T19:39:10.000Z","updated":"2016-12-02T07:06:18.000Z","comments":true,"path":"2016/12/03/CastBox-Being-Selected-as-One-of-Google-Play’s-“Best-of-2016”/","link":"","permalink":"http://blog.castbox.fm/2016/12/03/CastBox-Being-Selected-as-One-of-Google-Play’s-“Best-of-2016”/","excerpt":"","text":"Google Play’s “best apps of 2016” has been announced on Dec 1st, 2016. CastBox is honored to be selected as one of the best apps of 2016, under the section of “most entertaining”, as well as one of the top trending apps. Check out Google Play’s top five lists for the most popular content around the world in 2016 below. For complete local lists, visit Google Play. Check out here for full article of Google Play’s best app announcement: 2016 has been a great year for us. Our very first version of CastBox was launched in Jan with our CEO’s one’s effort; since then CastBox has been improving with more and more updated versions developed by our growing team. Thanks to Google Play for recognizing our efforts in the past year, and thanks to all of our users for helping us enriching our content and improving our user experiences. Thanks to all podcasters and podcast lovers for all the support. We look forward to the coming of 2017 and to bringing the world the best of CastBox. Download CastBox for FREE at http://castbox.fm/u/3 for Android and http://castbox.fm/u/4 for iOS.","categories":[],"tags":[],"keywords":[]},{"title":"Follow the Latest Trends in Innovation — 2016 Top 10 Tech Podcasts","slug":"Follow-the-Latest-Trends-in-Innovation-—-2016-Top-10-Tech-Podcasts","date":"2016-11-16T17:43:19.000Z","updated":"2016-12-11T02:13:29.000Z","comments":true,"path":"2016/11/17/Follow-the-Latest-Trends-in-Innovation-—-2016-Top-10-Tech-Podcasts/","link":"","permalink":"http://blog.castbox.fm/2016/11/17/Follow-the-Latest-Trends-in-Innovation-—-2016-Top-10-Tech-Podcasts/","excerpt":"","text":"Check out the most popular tech podcasts from around world in 2016. You can stream &amp; download them all using CastBox, the leading podcast app offering 340,000+ high quality podcasts for free. Or you can click on the podcast’s name, and listen to them on your desktop. If you already have CastBox on your device, simply clicking on the podcast’s name would take you to the podcast on your CastBox. 1. TEDTalks Technology TEDTalks Technology hosts the world’s leading inventors, researchers, and business leaders as they share their invaluable insights and creations with the general public. Topics include breakthroughs, visions, and demonstrations. 2. This Week in Tech Leo Laporte leads a roundtable discussion of the latest technological trends. Subscribe for knowledgeable and thought provoking conversation including product reviews, company news, and industry innovations. 3. World’s Funniest Ringtones for iPhone &amp; iPad by Hahaas Comedy Ringtones Listen to the !World’s Funniest Ringtones podcast to keep up-to-date with the best ringtones on the market. You will receive free ringtones once you subscribe and will receive information on over 10,000 currently downloadable ringtones. 4. Brainstuff Brainstuff is dedicated to explaining the everyday science of the world around us. Interesting, witty, and entertaining, past topics include the science of glow sticks, how we know what dinosaurs looked like, and how marijuana affects your memory. 5. Giant Bombcast Giant Bombcast is a fun and entertaining podcast where our hosts discuss the latest in video game news, taste-test questionable beverages, and discuss whatever comes into their heads. 6. Techstuff Join Jonathan Strickland as he explores the world of technology including the people behind the innovation, the companies that market it, and and how it affects of society, culture and lives in general. 7. Note to Self Host Manoush Zomorodi navigates through the difficult questions raised by the technological and digital age. For example, is your phone watching you? Should you post pictures of your loved one online? Are your kids even real? Tune in to find out. 8. The Smart Passive Income Podcast: Online Business | Blogging | Passive Income | Pat Flynn Pat Flynn reveals his online business and blogging strategies, income sources, and killer marketing tips so that you can stay ahead of the curve. A must for anyone looking to develop a reliable stream of passive income to support themselves or their families. 9. Reply All The Reply All podcast focuses on the internet along with trained rats, time travel, celebrity dogs, phone scammers who fall in love, angry flower children, workplace iguanas, and more. Confused? Just listen. 10. Apple Keynotes Apple Keynotes is an up-to-date source for all of Apple’s most important announcements including product releases, updates, future ambitions, and presentations by the company’s CEO, Tim Cook. Wanna have your own podcast? You can upload your podcast/audio files and start your channel for free on CastBox.FM! CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts usingCastBox , the leading podcast app offering 340,000+ high quality podcasts for free. Download our app @ CastBox ’s website (we support both IOS and Android) Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]},{"title":"Laugh a Little Everyday — 2016 Top 10 Comedy Podcasts For Relaxation","slug":"Laugh-a-Little-Everyday-—-2016-Top-10-Comedy-Podcasts-For-Relaxation","date":"2016-11-09T22:25:55.000Z","updated":"2016-12-02T07:11:15.000Z","comments":true,"path":"2016/11/10/Laugh-a-Little-Everyday-—-2016-Top-10-Comedy-Podcasts-For-Relaxation/","link":"","permalink":"http://blog.castbox.fm/2016/11/10/Laugh-a-Little-Everyday-—-2016-Top-10-Comedy-Podcasts-For-Relaxation/","excerpt":"","text":"Feeling a bit stressed? Check out the most popular comedy podcasts from around world in 2016. You can stream &amp; download them all using CastBox, the leading podcast app offering 340,000+ high quality podcasts for free. Or, just simple click on the podcasts name to listen it on the web! 10. The Adam Carolla Show The comedian Adam Carolla shares his daily thoughts on current events, relationships, politics and more. Featuring regular guests from the world of science and entertainment, The Adam Carolla Show is the #1 daily downloaded podcast in the world. 9. Rooster Teeth Podcast Named the Best Gaming Podcast of 2013, join the Rooster Teeth crew as they provide comedic commentary on the popular culture of the week including video games, movies, entertainment, sports, and current events. 8. No Such Thing as a Fish Hosted by writers from the award-winning BBC panel quiz QI, No Such Thing as a Fish is a witty and engaging look at interesting facts, some of which debunk commonly held perceptions and some that a truly incredible. 7. The Infinite Monkey Cage Physicist Brian Cox and comedian Robin Ince explore the world through the eyes of science touching on topics ranging from climate change and the science of sleep to racial identity and the mathematics behind sex and love. 6. Friday Night Comedy from BBC Radio 4 Download some of the BBC’s finest new comedy programs. Friday Night Comedy features shows such as The News Quiz, The Now Show, Dead Ringers, and The Museum of Curiosity. 5. Wait Wait… Don’t Tell Me! NPR’s weekly news panel quiz show, have a laugh and test your knowledge on current events while trying to figure out what is real and what has been made up. Featuring guest players from the world of sport and entertainment. 4. Welcome to Night Vale Twice-monthly community updates from the small town of Night Vale, featuring local weather, news, announcements from the sheriff’s secret police, and dark hooded figures with mysterious powers. Don’t get it? Just listen. You’ll catch up in no time. 3. Comedy Central Stand-Up Watch highlights from recent comedy specials and stand-up shows presented by Comedy Central, America’s funniest entertainment channel. Comics include Hannibal Buress, John Oliver, Whitney Cummings, and Louis C.K. 2. Monday Morning Podcast Listen to comedian Bill Burr rant about current events, past experiences, sports, life on tour, and respond to listeners’ comments and questions. Funny, insightful and stimulating; the Monday Morning Podcast is a great way to launch into the week ahead! 1. The Joe Rogan Experience The Joe Rogan Experience is a conversational podcast hosted by comedian and UFC commentator, Joe Rogan. Voted the Best Comedy podcast in 2012, Joe conducts fascinating interviews with athletes, comedians, actors, scientists, journalists and more. Wanna have your own podcast? You can upload your podcast/audio files and start your channel for free on CastBox.FM! CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts usingCastBox , the leading podcast app offering 340,000+ high quality podcasts for free. Download our app @ CastBox ’s website (we support both IOS and Android) Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]},{"title":"5 Political Podcasts to Listen to For Election 2016","slug":"5-Political-Podcasts-to-Listen","date":"2016-11-07T23:03:28.000Z","updated":"2016-12-02T07:14:55.000Z","comments":true,"path":"2016/11/08/5-Political-Podcasts-to-Listen/","link":"","permalink":"http://blog.castbox.fm/2016/11/08/5-Political-Podcasts-to-Listen/","excerpt":"","text":"The 2016 Election is only one day away; while many may have already decided on the candidate he/she is voting for, some may still wobbling around on making the final decision. It may have been the biggest and most important time of the year; CastBox has picked out 5 political podcasts for you to listen to, and to help you review on the candidates for Election 2016. You can simply listen to them by clicking on the name of the podcast. 1. Presidential “Leading up to Election Day 2016, The Washington Post’s Presidential podcast explores how each former American president reached office, made decisions, handled crises and redefined the role of commander-in-chief, starting with George Washington in week one and ending on week 44 with the president-elect. Hosted by Lillian Cunningham, the series features Pulitzer Prize-winning biographers like David McCullough and Washington Post journalists like Bob Woodward. New episodes are released on Sundays.” 2. Vox’s The Weeds “Everyone is always warning you not to get lost in the weeds. But not Vox’s Ezra Klein, Sarah Kliff, and Matthew Yglesias. They love the weeds. That’s where all the policy is. This is the podcast for people who follow politics because they love thinking about health care, economics, and zoning. It is not a podcast for people who like hearing talk about gaffes.” 3. FiveThirtyEight Elections “Nate Silver and the FiveThirtyEight team cover the 2016 election, tracking the issues and “game-changers” every week.” 4. Slate’s Political Gabfest “Voted “Favorite Political Podcast” by iTunes Listeners. Stephen Colbert says “Everybody should listen to the Slate Political Gabfest.” The Gabfest, featuring Slate’s Emily Bazelon, John Dickerson, and David Plotz, is the kind of informal and irreverent discussion Washington journalists have after hours over drinks. Part of the Panoply Network.” 5. Real Time With Bill Maher “Download and watch full episodes of Real Time with Bill Maher including his New Rules and Overtime segments with his guest panelists. ” Wanna have your own podcast? You can upload your podcast/audio files and start your channel for free on CastBox.FM!CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts usingCastBox, the leading podcast app offering 340,000+ high quality podcasts for free. Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]},{"title":"CastBox- Judges Favorite Award Winner of 2016 Google Demo Day, Women’s Edition","slug":"CastBox-Judges-Favorite-Award-Winner-of-2016-Google-Demo-Day-Women’s-Edition","date":"2016-11-07T19:09:00.000Z","updated":"2016-12-02T07:13:43.000Z","comments":true,"path":"2016/11/08/CastBox-Judges-Favorite-Award-Winner-of-2016-Google-Demo-Day-Women’s-Edition/","link":"","permalink":"http://blog.castbox.fm/2016/11/08/CastBox-Judges-Favorite-Award-Winner-of-2016-Google-Demo-Day-Women’s-Edition/","excerpt":"","text":"The Google Demo Day, Women’s Edition has finally come to an end. CastBox, an audio aggregation mobile app that serves as an audio platform, offering 400K+ podcasts, radio channels, audio books, etc and providing localized content across 135 countries, has won the Judges Favorite Award.“We had a great time presenting ourselves and meeting all the other 11 inspiring startups from all over the world. We are very thrilled to receive this great honor and recognition, and are definitely motivated and encouraged for achieving a even greater success in the near future!” — CastBox Team The presentations from all 12 startups are available on Youtube at https://goo.gl/J0qrMy; To make it more convenient to learn about CastBox, we’ve organized a summary of speech from our CEO, Xiaoyu Wang, at the presentation day. Why CastBoxWhile working at Google, our CEO and Co-Founder Xiaoyu, had always spent at least two hours a day on commute and jogging. To make good use of time, she had always listened to audio, including downloadable audiobooks, music, radios and podcasts. She therefore discovered this great opportunity in audio market, and found out from data that people spend an average of 95 minutes a day listening to audios from different devices. “I really wanted an app that could read my mind, know what I want to hear for different situations, seamlessly play my favorite episodes via different devices.” said Xiaoyu, at the presentation on Google Demo Day. What is CastBoxAs audio reach has been multiplied by nowadays mobile internet boom, and will potentially be extended by other smart hardwares, Xiaoyu captured this opportunity, and invented the audio app, CastBox, which is not music limited, and offers updated content for different needs. Users of CastBox are able to attain tremendous audio contents from all categories such as comics, education, news, and so on. The app is also upgraded every week based on data analysis. In order to provide the best user experience, CastBox has been localized in more than seventy countries, so users can subscribe audio contents in different languages. CastBox has also launched revenue sharing program with podcasters in order to create high quality content. News and books content are also purchased to make them audible by text-to-speech technology. The use of collaborative filter algorithm also helps audiences to discover contents they will be interested in. Moreover, all of the available audio content will be accessible via phones, cars, and smart home devices by simply using voice commands in the near future. Besides that, CastBox is also in the process of applying multiple monetization models, such as advertising, in-app purchase, and subscription. Team of CastBox Founders of CastBox, Xiaoyu and Shibin, are both ex-Googlers. Xiaoyu worked at Google, Japan, helping mobile developers on development and monetization; Shibin worked at Google, Ireland, helping developers on localization and promotion. Moreover, CastBox’s CTO, Xiaocong He, is one of the most senior developers in China with twenty years of coding experiences. The rest of CastBox’s team members are all experts on the global mobile internet business market, whom have amassed strong experiences on machine learning and app development. CastBox’s Achievement Although CastBox is only founded earlier this year, the growth is rapid. Within 10 months, it has already gotten nearly three million installations and the daily average time is more than 2 hours. Day 7 retention rate has also uplifted to fifty-nine percent. Moreover, CastBox has been featured by Google Play in 132 countries and is rated as the №1 Best Podcast Player App by third party media. What’s more important for CastBox are users’ feedbacks. Not only has CastBox received high ratings, with a score of 4.6 on Google Play, plus more than 10,000+ positive comments; one visually impaired girl from Russia even took time and wrote a thank-you letter to CastBox’s team, saying CastBox is her favorite app, as the audio content makes her life colorful. And one more to add now: thank you to Google for Entrepreneurs, People Squared, and all of our audiences and supporters, for awarding us the Judges Favorite Award at 2016 Google Demo Day, Women’s Edition. Future goals of CastBox “Regarding the big picture in the future: we believe that, besides Pandora and Spotify, there must be a non-music limited audio app to fulfill the huge and diversified audio needs. We believe that CastBox is THE ONE! To improve the way how people access information, is, and will always be our mission.” — said Xiaoyu, Wang, CEO and Co-Founder at CastBox. And at the very end…The whole team at CastBox want to thank everyone again for attending this great event, online and on site. Thank you again for all the supports and recognitions. We’ll make ourselves better and better everyday, to bring our users the best user experience! Track our progress and updates by following usonour Facebook, Twitter, LinkedIn, and Instagram accounts!","categories":[],"tags":[{"name":"Google Demo Day","slug":"Google-Demo-Day","permalink":"http://blog.castbox.fm/tags/Google-Demo-Day/"}],"keywords":[]},{"title":"TOP 10 Horror Films to Watch on the Halloween Weekend","slug":"TOP-10-Horror-Films-to-Watch-on-the-Halloween-Weekend","date":"2016-10-30T18:20:48.000Z","updated":"2016-11-07T10:59:40.000Z","comments":true,"path":"2016/10/31/TOP-10-Horror-Films-to-Watch-on-the-Halloween-Weekend/","link":"","permalink":"http://blog.castbox.fm/2016/10/31/TOP-10-Horror-Films-to-Watch-on-the-Halloween-Weekend/","excerpt":"","text":"Halloween weekend is always the best time to watch some horror films with your friends and family. Close your curtains, turn off your lights, volume up your speakers, and make this one-in-a-year weekend unforgettable. CastBox has put together a list of TOP 10 horror films, from all over the world, to help you make this weekend even more special and remarkable. 10. Ringu (1998) Ringu, 1998, directed by Hideo Nakata Ruthlessly murdered by her father, the ghost of a seer’s daughter kills all those seven days after they watch the strange contents of a mysterious video tape, unless the viewer finds the escape clause. As one of the most classic Japanese horror films in history, Ringu is on the top lists for horror film recommendations. Unlike those bloody images and techniques American horror films usually use, traditional Japanese horror films tend to focus more on the sound effect combined with spiritually shocking plots. Ringu may seem very scary to watch; but when it gets to the end, you’d discover another side that touches the deepest of your heart. 9. A Nightmare On Elm Street (1984) A Nightmare On Elm Street, 1984, directed by Wes Craven Several people are hunted by a cruel serial killer who kills his victims in their dreams. While the survivors are trying to find the reason for being chosen, the murderer won’t lose any chance to kill them as soon as they fall asleep. As the milestone of bloody R-rated films, the highlight of this film must be the inception the film creates for audiences. Unlike traditional murders, the film kills in people’s dreams, the most defenseless time of the day. Victims are either killed, or trapped. The background music also makes the film stands out from the crowd, especially for the use of the children’s song. The far away, yet near by voice of the child, makes you wonder, he/she may just be standing behind your back. 8. Carrie (1976)(2013) Carrie, 1976, directed by Brian De Palma (2013, directed by Kimberly Pierce) Carrie White, a shy, friendless 17 year-old girl who is sheltered by her domineering, religious mother, unleashes her telekinetic powers after being humiliated by her classmates at her senior prom. Based on Carrie written by Stephen King, the film not only became the pioneer of high school horror films, but also provided many ideas for modern horror films. The newer version acted by Chloe Moratz, cleverly uses the modern technology of after effects, thus creating a visual feast of horror for audiences. The older version, however, focuses more on the religious aspect, which then brings you to a deeper level of thinking afterwards. Both versions are highly recommended. 7. Case 39 (2009) Case 39, 2009, directed by Christian Alvart A social worker fights to save a girl from her abusive parents, only to discover that the situation is more dangerous than she ever expected. No ghost scenes. No monsters. No bloods. What makes the film special is the evil that lives in your heart. This evil’s name can be called jealousy, insecurity, selfishness… Be ready for psychological shocks, and be ready for the water scene… 6. The Conjuring 2 (2016) The Conjuring 2, 2016, directed by James Wan Lorraine and Ed Warren travel to north London to help a single mother raising four children alone in a house plagued by a malicious spirit. Most people are suspected about series horror films- it seems like the first one is always the best one; and the more it produces, the worse the series gets. However, horror film master James Wan surely did a spectacular job on his recent new horror film The Conjuring 2. Concise yet attracting and logical plot, unexpected jump scare, with a perfect blend of audio and visual effects, all help _The Conjuring 2 _stands out from modern horror films. James Wan’s films are always interesting to watch for the second time, as you’ll discover lots more details you might not have noticed before. 5. Oculus (2013) Oculus, 2013, directed by Mike Flanagan A woman tries to exonerate her brother, who was convicted of murder, by proving that the crime was committed by a supernatural phenomenon. The unexpected that captures audiences’ attention, for almost every film, is always a plot twist. In this film, right when you are still in the surprise or shock by a plot twist, another plot twist would be coming its way. When you just start to believe that something is real, the image would collapse and bring you back to the skeptical and emotional stage again. From the beginning until the end, all of the information you perceives seem real, yet they create an illusional circle and trap you in the center of it. You cannot stop questioning about yourself even after the film ends. And a great question to think of is, where’s the real oculus? 4. Kokuhaku “Confession” (2010) Confession, 2010, directed by Tetsuya Nakashima A psychological thriller of a grieving mother turned cold-blooded avenger with a twisty master plan to pay back those who were responsible for her daughter’s death. Extremely strong contrasting in both images and plots, from pure heaven to bloody hell, and an emphasis on the focus of to live or to die, are the most important elements of Japanese horror films. The film uses a very quiet and clean image tone, with soft and even a bit animated music, to elaborate a story about death and revenge. Lots of slow-motion scenes, emotionless faces, and dead silence all create a strong contrast with traditional horror film’s bloods, screams, and shocking faces. Sometimes, silence could be the scariest thing; the outcome of the sudden explosion of dead silence we are repressed in, could be destructive both psychologically, and physically. 3. Orphan (2009) Orphan, 2009, directed by Jaume Collet-Serra A husband and wife who recently lost their baby adopt a nine year-old girl who is not nearly as innocent as she claims to be. Orphan is more like in-between the category of horror and literary film because there seems to be no elements relating to the term “scary.” How could we link a 12-year-old girl to something thrilling? When our moral standards and sympathy got challenged again and again, we start to question, if our “standards” are just those “standards” we create on our own? The film is a bit Hitchcock style, making you worried and scared by any upcoming images it may appear on screen, just a nightmare becoming true. The huge plot twist in the end would also make you question the reality you are living in; those who live by your side, your closest friends and families, may also be hiding something from you. 2. Psycho (1960) Psycho, 1960, directed by Alfred Hitchcock A Phoenix secretary embezzles $40,000 from her employer’s client, goes on the run, and checks into a remote motel run by a young man under the domination of his mother. Nominated for 4 Oscars, and as a film produced in 1960, Psycho has not only gained its reputation among horror films, but can be seen as the pioneer of the whole film industry. The famous TV series Bates Motel, was based on the same story that happened in Psycho. If you want to get to know Hitchcock and how horror theme was filmed, you should start with Psycho. It first throws out a question for you to wonder; then distract your attention by making another question hanging there.It never ends with one simple plot twist, but one plot twist after one plot twist. Moreover, it never shows you the full image on screen but gives you the mise-en-scene by cinematographic techniques and audiences’ own imagination. Hitchcock was famous for his use of voyeurism, and you can definitely feel yourself being the “voyeur” inPsycho. So, if Psycho is a must seen film in life, why not watch it on the Halloween weekend? 1. The Shining (1980) The Shining, 1980, directed by Stanley Kubrick A family heads to an isolated hotel for the winter where an evil and spiritual presence influences the father into violence, while his psychic son sees horrific forebodings from the past and of the future. DANG DANG DANG DANG! Here comes the last film we recommend, directed by Stanley Kubrick, produced in 1980, the famous horror film- the Shining. Watching horror films is like eating sleeping pills; the more you watch/eat, the less sensitive it gets. Even the classic horror film Exorcist, can be apply to this rule. The Shining, however, is an exception. The more times you watch, the scarier it gets. It gives the modern horror film world a brand new definition. It does not only create physical and mental shock; the scariness would go into your bones, and frighten your spirit The whole film is like a nightmare which makes you believe in the existence of the supernaturals. The plot, instead of being logical, turns out to be completely illogical on the chronicle order. Time is not continuous anymore, but travels in a circle, which does not make sense for us in the real world. Is it then, that everything happens in the film, would be a story out of a story? We don’t know. What we do know is, the more detailed you watch this film, the more surprises you will find. As a podcast/radio app, we not only provide you some visual options for your Halloween weekend, but also offer you some audio selections associated with them. After watching horror films, let your eyes rest, put on your headphones, and think back to the plots with film podcasts on CastBox.Listen to Nightmare on Film Street:Podcast:Podcast:Nightmare On Film StreetNightmare on Film Street is a horror podcast laun…castbox.fm Listen to Stephen King Cast:Podcast:Podcast:Constant ReaderA weekly retrospective review of the works of Stephen King.castbox.fm Listen to The Stephen King Podcast:Podcast:Podcast:Lou SytsmaJoin co-hosts Hans Lilja, of Lilja’s Library and Lou Sytsma - Blogger &amp; Podcaster as we cover all things - Stephen King…castbox.fm For more podcasts relating to horror films and Halloween, check out on CastBox app! FREE Download on CastBox’s website or below(we support both IOS and Android) For iOS:CastBox Podcast &amp; Radio - Cloud of free fm sound on the App StoreRead reviews, compare customer ratings, see screenshots, and learn more about CastBox Podcast &amp; Radio - Cloud of free…itunes.apple.com For Android:Podcast Radio Music - CastBox - Android Apps on Google PlayFree Podcast Radio App - Education/News/Music/Comedy/Kids/radio/podcastplay.google.com CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts usingCastBox, the leading podcast app offering 340,000+ high quality podcasts for free. Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts. .s_quote_left{ width: 35%!important; display: inline-block; padding-right: 12px!important; float: left; } .s_quote_small{ width: 20%!important; display: inline-block; padding-right: 12px!important; float: left; }","categories":[],"tags":[],"keywords":[]},{"title":"The Whole World is Listening — 2016 Top 10 Podcasts You Don’t Want to Miss","slug":"2016-Top-10-Podcasts-You-Don’t-Want-to-Miss","date":"2016-10-29T23:20:51.000Z","updated":"2016-10-31T07:21:51.000Z","comments":true,"path":"2016/10/30/2016-Top-10-Podcasts-You-Don’t-Want-to-Miss/","link":"","permalink":"http://blog.castbox.fm/2016/10/30/2016-Top-10-Podcasts-You-Don’t-Want-to-Miss/","excerpt":"","text":"As a podcast/radio app, we have put a list of the most popular podcasts from around world in 2016. Hope this can give you some ideas of what to listen in various fields. .left{ width: 35%; max-width: 60px; max-height: 60px; display: inline-block; margin-right: 12px; } 10. Comedy Central Stand-UpWatch highlights from recent comedy specials and stand-up shows presented by Comedy Central, America’s funniest entertainment channel. Comics include Hannibal Buress, John Oliver, Whitney Cummings, and Louis C.K. 9. Monday Morning PodcastListen to comedian Bill Burr rant about current events, past experiences, sports, life on tour, and respond to listeners’ comments and questions. Funny, insightful and stimulating; the Monday Morning Podcast is a great way to launch into the week ahead! 8. RadiolabRadiolab combines politics, science, and culture to inspire a sense of wonder while maintaining a healthy dose of skepticism. Broadcast across 500+ local radio stations in the United States, Radiolab is ideal for the listener with a curious and agile mind. 7. Freakonomics RadioHosted by Stephen J. Dubner, co-author of the bestselling Freakonomics books, Freakonomics Radio explores “the riddles of everyday life” with humor, intellect, and above all, originality. Guests include authors, entrepreneurs and social scientists. 6. English as a Second Language (ESL) Podcast — Learn English OnlineThe ESL Podcast is perfect for anyone looking to improve their English listening and speaking skills. Hosted by Dr. Jeff McQuillan, former professor of applied linguistics at California State, lessons are useful, comprehensive and engaging. 5. The Joe Rogan ExperienceThe Joe Rogan Experience is a conversational podcast hosted by comedian and UFC commentator, Joe Rogan. Voted the Best Comedy podcast in 2012, Joe conducts fascinating interviews with athletes, comedians, actors, scientists, journalists and more. 4. Stuff You Should KnowThe Stuff You Should Know podcast explains popular phenomena in a simple and entertaining way. Episodes break down complex diseases, explore the workings of technology, and dive into questions of philosophy, ethics and psychology. 3. This American LifeInspiring the Emmy award-winning TV show of the same name, This American Life releases episodes weekly, each driven by a particular theme relevant to the american experience. Half a dozen stories from the podcast are being developed into films. 2. SerialFrom the creators of This American Life, join Sarah Koenig as she narrates a single, fascinating story over the course of an entire season. Season 1 told of the 1999 murder of a Baltimore high school student, a case with many loose ends even today. 1. TEDTalksThe TEDTalks series of podcasts host the world’s leading thinkers and doers as they share ideas on the frontier of human understanding and experience. An absolute must for all podcasters, TEDTalks never fails to inspire, intrigue and stir the imagination. Wanna have your own podcast? You can upload your podcast/audio files and start your channel for free on CastBox.FM! CastBox is the main product of Guru Inc., a smart startup team founded by xGoogler with App gene. It has been featured for 115 Countries by Google Editor within 1 month. You can stream&amp;download all of the above podcasts using CastBox, the leading podcast app offering 340,000+ high quality podcasts for free. Download our app @ CastBox’s website (we support both IOS and Android) Follow us @ our Facebook, Twitter, LinkedIn, and Instagram accounts.","categories":[],"tags":[],"keywords":[]}]}